In [1]:
import pandas as pd

In [21]:
one = pd.DataFrame({'x':['x1','x2','x3'] , 'y':['y1','y2','y3']}, index = ['a1','b1','c1'])

In [23]:
two  = pd.DataFrame({'k':['x11','x22','x33'] , 'l':['y11','y22','y33']}, index = ['a1','d1','c1'])

In [25]:
one

     x   y
a1  x1  y1
b1  x2  y2
c1  x3  y3

In [27]:
two

      k    l
a1  x11  y11
d1  x22  y22
c1  x33  y33

In [29]:
one.join(two)

     x   y    k    l
a1  x1  y1  x11  y11
b1  x2  y2  NaN  NaN
c1  x3  y3  x33  y33

In [31]:
two.join(one)

      k    l    x    y
a1  x11  y11   x1   y1
d1  x22  y22  NaN  NaN
c1  x33  y33   x3   y3

In [35]:
one.join(two , how = 'right')

      x    y    k    l
a1   x1   y1  x11  y11
d1  NaN  NaN  x22  y22
c1   x3   y3  x33  y33

In [67]:
k1=one.join(two , how = 'outer')

In [69]:
k1

      x    y    k    l
a1   x1   y1  x11  y11
b1   x2   y2  NaN  NaN
c1   x3   y3  x33  y33
d1  NaN  NaN  x22  y22

In [71]:
l1=k1.isna()

In [73]:
l1

        x      y      k      l
a1  False  False  False  False
b1  False  False   True   True
c1  False  False  False  False
d1   True   True  False  False

In [79]:
l1.dropna()

        x      y      k      l
a1  False  False  False  False
b1  False  False   True   True
c1  False  False  False  False
d1   True   True  False  False

In [57]:
one

     x   y
a1  x1  y1
b1  x2  y2
c1  x3  y3